OdRxDynamicCollectionAttribute.remove(OdRxDynamicAttribute!System.Runtime.CompilerServices.IsConst*)
\details
Removes the attribute from the collection.
\param attribute [in]  Attribute to be removed from the collection.
\returns
eOk if successful or eKeyNotFound otherwise.

OdRxDynamicCollectionAttribute.add(OdRxDynamicAttribute!System.Runtime.CompilerServices.IsConst*)
\details
Add an attribute to the collection.
\param attribute [in]  Attribute to be added to the collection.
\returns
eOk if operation was successful; eInvalidInput if the attribute parameter is
invalid.

OdRxDynamicCollectionAttribute.getByName(OdString!System.Runtime.CompilerServices.IsConst,System.Boolean)
\details
Retrieve the attribute by its name.
\param name [in]  Name of the attribute to be retrieved.
\param caseSensitive [in] Case sensitive string comparison flag.
\returns
Pointer to the attribute at the given index.
\details
Retrieve the attribute by its name (non-constant version).
\param name [in]  Name of the attribute to be retrieved.
\param caseSensitive [in] Case sensitive string comparison flag.
\returns
Pointer to the attribute at the given index.

OdRxDynamicCollectionAttribute.getAt(System.Int32)
\details
Retrieve the attribute at the index (constant version).
\param index [in]  Index of the attribute to be retrieved.
\returns
Pointer to the attribute at the given index.
\details
Retrieve the attribute at the index (non-constant version).
\param index [in]  Index of the attribute to be retrieved.
\returns
Pointer to the attribute at the given index.

OdRxDynamicCollectionAttribute.count
\details
Constructor. Creates an attribute of the OdRxDynamicCollectionAttribute type.
\returns
Smart pointer to a constructed attribute object.
\details
Get the number of elements in the collection.
\returns
Number of elements in the collection.